# Ayudantía 3

En esta ayudantía retomaremos lo dejado en el problema anterior y veremos los siguientes tópicos:
 - método `__str__`
 - Pipeline
 - Wranglers
 - Regresión logística
 - ejercicio de practica
 - usos de librería pandas
 - usos de libreria matplotlib

Primero escribamos una clase para hacer el ejemplo

In [8]:
class Punto(object):
    """ Representación de un punto en el plano, los atributos son x e y
        que representan los valores de las coordenadas cartesianas."""
    def __init__(self, x=0, y=0):
        """ Constructor de Punto, x e y deben ser numéricos,
            de no ser así, se levanta una excepción TypeError """
        if self.es_numero(x) and self.es_numero(y):
            self.x=x
            self.y=y
        else:
            raise TypeError("x e y deben ser valores numéricos")
            
    def es_numero(self,valor):
        """ Indica si un valor es numérico o no. """
        return isinstance(valor, (int, float, complex) )
    
    def distancia(self, otro):
        """ Devuelve la distancia entre ambos puntos. """
        dx = self.x - otro.x
        dy = self.y - otro.y
        return (dx*dx + dy*dy)**0.5
    
    def restar(self, otro):
        """ Devuelve un nuevo punto, con la resta entre dos puntos. """
        return Punto(self.x - otro.x, self.y - otro.y)
    
    def norma(self):
        """ Devuelve la norma del vector que va desde el origen
            hasta el punto. """
        return (self.x*self.x + self.y*self.y)**0.5

Además recordemos uno de los métodos especiales, `__init_`, el constructor de la clase. Este método se llama cada vez que se crea una nueva instancia de la clase.

Para definir atributos, basta con definir una variable dentro de la instancia utilizando `self.`, es una buena idea definir todos los atributos de nuestras instancias en el constructor, de modo que se creen con algún valor válido. En nuestro ejemplo `self.x` y `self.y` y se usarán como  `punto.x` y `punto.y`.

In [9]:
p = Punto(5,7)
q = Punto(2,3)
r = p.restar(q)
print(r.x, r.y)

3 4

In [10]:
print(r.norma())

5.0

In [11]:
print(q.distancia(r))

1.4142135623730951

In [12]:
print(q)

<__main__.Punto object at 0x1a15de2940>

##  Un método para mostrar objetos

Para mostrar objetos, Python indica que hay que agregarle a la clase un método especial, llamado *`__str__`* que debe devolver una cadena de caracteres con lo que queremos mostrar. Ese método se invoca cada vez que se llama a la función `str`.

El método *`__str__`* tiene un solo parámetro, `self`.

En nuestro caso decidimos mostrar el punto como un par ordenado, por lo que escribimos el siguiente método dentro de la clase Punto:

In [13]:
class Punto(object):
    """ Representación de un punto en el plano, los atributos son x e y
        que representan los valores de las coordenadas cartesianas."""
    def __init__(self, x=0, y=0):
        """ Constructor de Punto, x e y deben ser numéricos,
            de no ser así, se levanta una excepción TypeError """
        if self.es_numero(x) and self.es_numero(y):
            self.x=x
            self.y=y
        else:
            raise TypeError("x e y deben ser valores numéricos")
            
    def es_numero(self,valor):
        """ Indica si un valor es numérico o no. """
        return isinstance(valor, (int, float, complex) )
    
    def distancia(self, otro):
        """ Devuelve la distancia entre ambos puntos. """
        dx = self.x - otro.x
        dy = self.y - otro.y
        return (dx*dx + dy*dy)**0.5
    
    def restar(self, otro):
        """ Devuelve un nuevo punto, con la resta entre dos puntos. """
        return Punto(self.x - otro.x, self.y - otro.y)
    
    def norma(self):
        """ Devuelve la norma del vector que va desde el origen
            hasta el punto. """
        return (self.x*self.x + self.y*self.y)**0.5
    
    def __str__(self):
        """ Muestra el punto como un par ordenado. """
        return "(" + str(self.x) + ", " + str(self.y) + ")"

In [14]:
p = Punto(-6,18)
str(p)

'(-6, 18)'

In [15]:
print(p)

(-6, 18)

##  Métodos para operar matemáticamente
Ya hemos visto un método que permitía restar dos puntos. Si bien esta implementación es perfectamente válida, no es posible usar esa función para realizar una resta con el operador -.

In [16]:
p = Punto(3,4)
q = Punto(2,5)
print(p - q)

TypeError: unsupported operand type(s) for -: 'Punto' and 'Punto'

Si queremos que este operador (o el equivalente para la suma) funcione, será necesario implementar algunos métodos especiales.

In [18]:
class Punto(object):
    """ Representación de un punto en el plano, los atributos son x e y
        que representan los valores de las coordenadas cartesianas."""
    def __init__(self, x=0, y=0):
        """ Constructor de Punto, x e y deben ser numéricos,
            de no ser así, se levanta una excepción TypeError """
        if self.es_numero(x) and self.es_numero(y):
            self.x=x
            self.y=y
        else:
            raise TypeError("x e y deben ser valores numéricos")
            
    def es_numero(self,valor):
        """ Indica si un valor es numérico o no. """
        return isinstance(valor, (int, float, complex) )
    
    def distancia(self, otro):
        """ Devuelve la distancia entre ambos puntos. """
        dx = self.x - otro.x
        dy = self.y - otro.y
        return (dx*dx + dy*dy)**0.5
    
    def restar(self, otro):
        """ Devuelve un nuevo punto, con la resta entre dos puntos. """
        return Punto(self.x - otro.x, self.y - otro.y)
    
    def norma(self):
        """ Devuelve la norma del vector que va desde el origen
            hasta el punto. """
        return (self.x*self.x + self.y*self.y)**0.5
    
    def __str__(self):
        """ Muestra el punto como un par ordenado. """
        return "(" + str(self.x) + ", " + str(self.y) + ")"

    def __add__(self, otro):
        """ Devuelve la suma de ambos puntos. """
        return Punto(self.x + otro.x, self.y + otro.y)

    def __sub__(self, otro):
        """ Devuelve la resta de ambos puntos. """
        return Punto(self.x - otro.x, self.y - otro.y)

El método *`__add__`* es el que se utiliza para el operador +, el primer parámetro es el primer operando de la suma, y el segundo parámetro el segundo operando. Debe devolver una nueva instancia, nunca modificar la clase actual. De la misma forma, el método *`__sub__`* es el utilizado por el operador -.

Ahora es posible operar con los puntos directamente mediante los operadores, en lugar de llamar a métodos:

In [19]:
p = Punto(3,4)
q = Punto(2,5)
print( p - q )

(1, -1)

In [20]:
print( p + q )

(5, 9)

In [21]:
pmq = p - q

In [22]:
print(pmq)

(1, -1)

Para seguir practicando sobre la creación de clases, puedes revisar [está página](https://uniwebsidad.com/libros/algoritmos-python/capitulo-14/creando-clases-mas-complejas) (en español).

# Pipelines

### WHAT?

Pipelines allow you to create a single object that includes all steps from data preprocessing and classification.

WHY?

* Increase reproducibility
* Make it easier to use cross validation and other types of model selection.
* Avoid common mistakes such as leaking data from training sets into test sets.

## Simplest possible Pipeline
Just a classifier and one preprocessing step (data standardization)

In [23]:
from sklearn.datasets import make_regression,make_classification

from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression

In [24]:
X, y = make_classification(n_samples=100,n_features=10,n_informative=2)

X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.33, random_state=42)

In [25]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((67, 10), (33, 10), (67,), (33,))

In [26]:
# it takes a list of tuples as parameter
pipeline = Pipeline([
    ('scaler',StandardScaler()),
    ('clf', LogisticRegression())
])

# use the pipeline object as you would
# a regular classifier
pipeline.fit(X_train,y_train)

Pipeline(memory=None,
     steps=[('scaler', StandardScaler(copy=True, with_mean=True, with_std=True)), ('clf', LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False))])

In [27]:
y_preds = pipeline.predict(X_test)

In [28]:
accuracy_score(y_test,y_preds)

0.7272727272727273

# Data Wrangling

Dealing with messy data.

* Google is your best friend.


## Python

Libraries needed:
* numpy
* pandas
* matplotlib
* scikit-learn


### Recomendations:

6.0001 Introduction to Computer Science and Programming in Python:
- https://www.youtube.com/playlist?list=PLUl4u3cNGP63WbdFxL8giv4yhgdMGaZNA
- https://courses.edx.org/courses/course-v1:MITx+6.00.1x+2T2017_2/course/

In [29]:
import numpy as np
import pandas as pd
import pylab as pl

## The MovieLens data

http://grouplens.org/datasets/movielens/

Example inspired by Verena Kaynig-Fittkau & [Greg Reda](http://www.gregreda.com/2013/10/26/using-pandas-on-the-movielens-dataset/)

We start by loading the [users](http://files.grouplens.org/datasets/movielens/ml-100k/u.user), [ratings](http://files.grouplens.org/datasets/movielens/ml-100k/u.data), and [movies](http://files.grouplens.org/datasets/movielens/ml-100k/u.item) data

In [30]:
# Load the users data
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
        sep='|', names = u_cols)
users.head(10)

   user_id  age sex     occupation zip_code
0        1   24   M     technician    85711
1        2   53   F          other    94043
2        3   23   M         writer    32067
3        4   24   M     technician    43537
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201
8        9   29   M        student    01002
9       10   53   M         lawyer    90703

In [31]:
# Load the ratings data

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.data', sep='\t', names=r_cols)

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [32]:
# Load movies data

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date','video_release_date', 'imdb_url']

movies = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.item',
                     sep='|', names=m_cols,  usecols=range(5), encoding='iso-8859-1')

movies.head(10)

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)
5,6,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,01-Jan-1995,NaN,http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...
6,7,Twelve Monkeys (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Twelve%20Monk...
7,8,Babe (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Babe%20(1995)
8,9,Dead Man Walking (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Dead%20Man%20...
9,10,Richard III (1995),22-Jan-1996,NaN,http://us.imdb.com/M/title-exact?Richard%20III...

## Get info about the data

In [33]:
print(movies.dtypes)
print("------------")
print(movies.describe())
# *** Why only those two columns? ***
print("------------")
print(ratings.describe())
print("------------")
print(users.describe())

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object
------------
          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN
------------
            user_id       movie_id         rating  unix_timestamp
count  100000.00000  100000.000000  100000.000000    1.000000e+05
mean      462.48475     425.530130       3.529860    8.835289e+08
std       266.61442     330.798356       1.125674    5.343856e+06
min         1.00000       1.000000       1.000000    8.747247e+08
25%       254.00000     175.000000       3.000000    8.794487e+08
50%       447.00000     322.000000       4.000000    8.828269e+08
75%       682.00000     631.000000       4.000000    8.882600e+08
max       943.00000    1682.000000       5.000000    8.932866e+08
------------
          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

## Merging data

In [34]:
# create one merged DataFrame

movie_ratings = pd.merge(movies, ratings)
lens = pd.merge(movie_ratings, users)

In [35]:
movie_ratings.head()

,movie_id,title,release_date,video_release_date,imdb_url,user_id,rating,unix_timestamp
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,308,4,887736532
1,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,287,5,875334088
2,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,148,4,877019411
3,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,280,4,891700426
4,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,66,3,883601324

In [36]:
lens.head()

,movie_id,title,release_date,video_release_date,imdb_url,user_id,rating,unix_timestamp,age,sex,occupation,zip_code
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,308,4,887736532,60,M,retired,95076
1,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,308,5,887737890,60,M,retired,95076
2,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),308,4,887739608,60,M,retired,95076
3,7,Twelve Monkeys (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Twelve%20Monk...,308,4,887738847,60,M,retired,95076
4,8,Babe (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Babe%20(1995),308,5,887736696,60,M,retired,95076

## Selecting data

* DataFrame => group of Series with shared index
* single DataFrame column => Series

In [37]:
users['occupation'].unique() #unique

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [38]:
# Selecting more than one column
columns_you_want = ['occupation', 'sex'] 
users[columns_you_want].head()

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

## Filtering data

In [39]:
# Show users over 18
adultUsers =   users[users.age >= 18] #users['age']
adultUsers.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [40]:
# Show teenagers
teenUsers = users[(users.age >= 13) & (users.age<20)]
teenUsers.head()

    user_id  age sex occupation zip_code
35       36   19   F    student    93117
51       52   18   F    student    55105
56       57   16   M       none    84010
66       67   17   M    student    60402
67       68   19   M    student    22904

#### more complex filters
* Show male teenagers
* Show the mean age of female programmers

In [42]:
# Show male teenagers
print(users[(users.sex == 'M') & (users.age>=10) &(users.age<20)].head())

print('------------')

# Show the mean age of female programmers
print(users[(users.sex == 'F') & (users.occupation == 'programmer')]['age'].mean())

     user_id  age sex occupation zip_code
56        57   16   M       none    84010
66        67   17   M    student    60402
67        68   19   M    student    22904
100      101   15   M    student    05146
109      110   19   M    student    77840
------------
32.166666666666664

## Sorting

What are the most rated movies?

In [43]:
lens.title.value_counts().sort_values(ascending=True)

Tokyo Fist (1995)                                 1
Hungarian Fairy Tale, A (1987)                    1
Shadows (Cienie) (1988)                           1
Wend Kuuni (God's Gift) (1982)                    1
Girls Town (1996)                                 1
Brother's Kiss, A (1997)                          1
Stefano Quantestorie (1993)                       1
August (1996)                                     1
Hedd Wyn (1992)                                   1
Hush (1998)                                       1
Mamma Roma (1962)                                 1
Fire on the Mountain (1996)                       1
Nemesis 2: Nebula (1995)                          1
Á köldum klaka (Cold Fever) (1994)                1
Butterfly Kiss (1995)                             1
Favor, The (1994)                                 1
Pharaoh's Army (1995)                             1
All Things Fair (1996)                            1
Hostile Intentions (1994)                         1
Gate of Heavenly Peace, The (1995)                1
Angela (1995)                                     1
Other Voices, Other Rooms (1997)                  1
Damsel in Distress, A (1937)                      1
Cyclo (1995)                                      1
Death in Brunswick (1991)                         1
Wedding Bell Blues (1996)                         1
Touki Bouki (Journey of the Hyena) (1973)         1
Lady of Burlesque (1943)                          1
Mat' i syn (1997)                                 1
Good Morning (1971)                               1
                                               ...
Monty Python and the Holy Grail (1974)          316
Saint, The (1997)                               316
Forrest Gump (1994)                             321
Princess Bride, The (1987)                      324
Willy Wonka and the Chocolate Factory (1971)    326
Indiana Jones and the Last Crusade (1989)       331
Fugitive, The (1993)                            336
Mission: Impossible (1996)                      344
Back to the Future (1985)                       350
Titanic (1997)                                  350
Star Trek: First Contact (1996)                 365
Empire Strikes Back, The (1980)                 367
Rock, The (1996)                                378
Chasing Amy (1997)                              379
Jerry Maguire (1996)                            384
Silence of the Lambs, The (1991)                390
Twelve Monkeys (1995)                           392
Pulp Fiction (1994)                             394
Godfather, The (1972)                           413
Raiders of the Lost Ark (1981)                  420
Independence Day (ID4) (1996)                   429
Air Force One (1997)                            431
Toy Story (1995)                                452
Scream (1996)                                   478
English Patient, The (1996)                     481
Liar Liar (1997)                                485
Return of the Jedi (1983)                       507
Fargo (1996)                                    508
Contact (1997)                                  509
Star Wars (1977)                                583
Name: title, Length: 1664, dtype: int64

In [44]:
sorted_lens = lens.groupby(['movie_id','title']).size().sort_values(ascending=False)
sorted_lens

#sorted_lens = lens.groupby(['movie_id','title'])
#sorted_lens = sorted_lens.size()
#sorted_lens = sorted_lens.sort_values(ascending=False)

movie_id  title
50        Star Wars (1977)                                583
258       Contact (1997)                                  509
100       Fargo (1996)                                    508
181       Return of the Jedi (1983)                       507
294       Liar Liar (1997)                                485
286       English Patient, The (1996)                     481
288       Scream (1996)                                   478
1         Toy Story (1995)                                452
300       Air Force One (1997)                            431
121       Independence Day (ID4) (1996)                   429
174       Raiders of the Lost Ark (1981)                  420
127       Godfather, The (1972)                           413
56        Pulp Fiction (1994)                             394
7         Twelve Monkeys (1995)                           392
98        Silence of the Lambs, The (1991)                390
237       Jerry Maguire (1996)                            384
117       Rock, The (1996)                                378
172       Empire Strikes Back, The (1980)                 367
222       Star Trek: First Contact (1996)                 365
313       Titanic (1997)                                  350
204       Back to the Future (1985)                       350
405       Mission: Impossible (1996)                      344
79        Fugitive, The (1993)                            336
210       Indiana Jones and the Last Crusade (1989)       331
151       Willy Wonka and the Chocolate Factory (1971)    326
173       Princess Bride, The (1987)                      324
69        Forrest Gump (1994)                             321
168       Monty Python and the Holy Grail (1974)          316
748       Saint, The (1997)                               316
269       Full Monty, The (1997)                          315
                                                         ...
1414      Coldblooded (1995)                                1
1606      Deceiver (1997)                                   1
1156      Cyclo (1995)                                      1
1681      You So Crazy (1994)                               1
857       Paris Was a Woman (1995)                          1
1613      Tokyo Fist (1995)                                 1
711       Substance of Fire, The (1996)                     1
1614      Reluctant Debutante, The (1958)                   1
1236      Other Voices, Other Rooms (1997)                  1
1616      Desert Winds (1995)                               1
1596      Nemesis 2: Nebula (1995)                          1
677       Fire on the Mountain (1996)                       1
1580      Liebelei (1933)                                   1
1595      Shopping (1994)                                   1
1581      Woman in Question, The (1950)                     1
1582      T-Men (1947)                                      1
1583      Invitation, The (Zaproszenie) (1986)              1
1584      Symphonie pastorale, La (1946)                    1
1586      Lashou shentan (1992)                             1
1587      Terror in a Texas Town (1958)                     1
1461      Here Comes Cookie (1935)                          1
1460      Sleepover (1995)                                  1
1458      Damsel in Distress, A (1937)                      1
1457      Love Is All There Is (1996)                       1
1453      Angel on My Shoulder (1946)                       1
1452      Lady of Burlesque (1943)                          1
1593      Death in Brunswick (1991)                         1
1447      Century (1993)                                    1
814       Great Day in Harlem, A (1994)                     1
1682      Scream of Stone (Schrei aus Stein) (1991)         1
Length: 1682, dtype: int64

## Pivoting

A pivot table is a table that summarizes data in another table, and is made by applying an operation such as sorting, averaging, or summing to data in the first table, typically including grouping of the data.

Let's calculate the mean rating for men and women for each film.

In [51]:
pivoted = lens.pivot_table(index=['movie_id', 'title'],
                           columns=['sex'],
                           values='rating',
                           #operation = 'std',
                           fill_value=0)

#pivot_table() function has the mean as a default operation.


pivoted.head()

sex                                F         M
movie_id title
1        Toy Story (1995)   3.789916  3.909910
2        GoldenEye (1995)   3.368421  3.178571
3        Four Rooms (1995)  2.687500  3.108108
4        Get Shorty (1995)  3.400000  3.591463
5        Copycat (1995)     3.772727  3.140625

In [57]:
pivoted.sort_values(ascending=False, by = 'F').head()

sex                                                F         M
movie_id title
884      Year of the Horse (1997)                5.0  3.000000
1189     Prefontaine (1997)                      5.0  5.000000
1451     Foreign Correspondent (1940)            5.0  3.785714
1368     Mina Tannenbaum (1994)                  5.0  3.000000
119      Maya Lin: A Strong Clear Vision (1994)  5.0  4.333333

* list all occupations and how many mens and females works on they.

In [48]:
# list all occupations and how many mens and females works on they.
users.groupby([ 'occupation','sex']).size().head()

occupation     sex
administrator  F      36
               M      43
artist         F      13
               M      15
doctor         M       7
dtype: int64

# Regresión Logística

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pylab as plt
from sklearn.linear_model import LogisticRegression
from sklearn.grid_search import GridSearchCV
from sklearn.metrics import confusion_matrix
from sklearn.model_selection import train_test_split

### Regresión logística sobre datos normales multivariados:
Queremos hacer una regresión logística de manera de discriminar entre datos que provienen de una distribución normal multivariada

In [ ]:
from scipy.stats import multivariate_normal

#Crearemos los datos:

mu = np.array([[0.5, 0.5],
              [0.75, 0.8],
              [1, 0.75]])
S = np.array([[[0.02, 0],
             [0, 0.01]],
             [[0.02, 0.01],
             [0.01, 0.02]],
             [[0.01, 0],
             [0, 0.02]]])

K = mu.shape[0]
mvn = []
x = []
N = 100
for i in range(mu.shape[0]):
    mvn.append(multivariate_normal(mean=mu[i], cov=S[i]))
    x.append(mvn[i].rvs(N))

bins = 100
grid_x1 = np.linspace(0, 1.5, bins)
grid_x2 = np.linspace(0, 1.5, bins)
x1_v, x2_v = np.meshgrid(grid_x1, grid_x2)

def plotMVN (mvn):
    K = len(mvn)
    for i in range(K):
        P = mvn[i].pdf(np.array([x1_v.flatten(), x2_v.flatten()]).transpose())
        plt.contour(grid_x1, grid_x2, P.reshape ([bins, bins]),
               levels=np.array([0.2, 0.5, 0.9])*P.max(),
               colors=colors[i])

plt.clf()
plt.figure(figsize =(4,4))
colors = ["blue", "red", "green"]
plotMVN (mvn)
for i in range(K):
    plt.plot (x[i][:, 0], x[i][:, 1], "+", color = colors[i])
plt.show()

### Clasificación Binaria
Partiremos con una clasificación binaria utilizando sólo dos clases: $K=2$

In [ ]:
mvn2 = mvn[0:2]

plt.clf()
plt.figure(figsize =(4,4))
plotMVN (mvn2)
plt.show()

La Regresión Logística intenta estimar la probabilidad $p(C_1|\boldsymbol{x})$ utilizando una función llamada función logistica o función Sigmoide

$p(C_1|\boldsymbol{x}) = y(\boldsymbol{x}) = \sigma (w_0 + w_1x_1 + \cdots + w_mx_m)= \sigma(\boldsymbol{w}^\top\boldsymbol{\phi})$,

Donde: 


$\sigma(a) = \frac{1}{1+\exp(-a)} = \frac{\exp(a)}{1 + \exp(a)}$.

In [ ]:
a = np.arange(-10, 10, 0.1)

plt.clf()
plt.plot(a, 1./(1.+np.exp(-a)))
plt.show()

### Estimación de máxima verosimilitud para Regresión Logística


Dado $\boldsymbol{x}$, la probabilidad de ser de clase $C_1$ es $\sigma(\boldsymbol{w}^\top\boldsymbol{x} + w_0)$. Por simplicidad, utilizamos la variable aleatoria $y \in \{0, 1\}$, donde $y = 1$ cuando el objeto es de clase $C_1$, y $y=0$ cuando el objeto es de clase $C_2$. En ese sentido, podemos definir:

$p(y|\boldsymbol{x}) = \sigma^y(1-\sigma)^{1-y}$,

Donde hemos omitido $\boldsymbol{w}^\top\boldsymbol{\phi}$ para simplificar la notación. Asumiendo que las observaciones son independientes, podemos obtener la función de verosimilitud:

$p(\boldsymbol{y}|\boldsymbol{w}) = \prod_{n = 1}^N \sigma_n^{y_n}(1-\sigma_n)^{1-y_n}$

Donde $\{(\boldsymbol{x}_n, y_n)\}_{n = 1}^N$ representa los atributos y sus respectivas etiquetas, y además $\sigma_n = \sigma(\boldsymbol{w}^\top\boldsymbol{\phi_n})$. Podemos definitir una función de error tomando el negativo del logaritmo de la verosimilitud, el cual nos da el error de _entropia-cruzada_, de la forma:


$E(\boldsymbol{w}) = -\ln p(\boldsymbol{y}|\boldsymbol{w}) = -\sum_{n=1}^N \{y_n\ln \sigma_n + (1-y_n)\ln (1-\sigma_n)\}$.

Esto es lo que queremos minimizar respecto a los parámetros $w$

In [ ]:
N1 = 50
N2 = 50
x2 = np.concatenate ((mvn[0].rvs(N1), mvn[1].rvs(N2)))
y2 = np.zeros(N1 + N2)
y2[:N1] = 1

plt.clf()
plt.figure(figsize=(4,4))
plt.scatter (x2[:, 0], x2[:,1], c = (1-y2), alpha = 0.8, cmap=plt.cm.jet)
plotMVN (mvn2)
plt.show()

In [ ]:
logreg = LogisticRegression()
logreg.fit(x2,y2)

y_pred = logreg.predict(np.c_[x1_v.ravel(), x2_v.ravel()])
y_pred = y_pred.reshape((bins, bins))

plt.clf()
plt.figure(figsize=(4,4))
plt.contourf(x1_v, x2_v, y_pred, cmap=plt.cm.Paired, alpha=0.8)
plt.scatter (x2[:, 0], x2[:,1], c = (1-y2), alpha = 0.5, cmap=plt.cm.jet)
plotMVN (mvn2)
plt.show()

### Regresión Logística Regularizada

Recordando, queremos optimizar el negativo del logaritmo de la verosimilitud:

$E(\boldsymbol{w}) = -\ln p(\boldsymbol{y}|\boldsymbol{w}) = -\sum_{n=1}^N \{y_n\ln \sigma_n + (1-y_n)\ln (1-\sigma_n)\}$.

**Occam's razor:** Entre las hipótesis que explican el mismo experimento, la más simple debería ser seleccionada.

Podemos añadir una penalización a esta función de verosimilitud para forzar la obtención de modelos más simples:

$E(\boldsymbol{w}) = -\sum_{n=1}^N \{y_n\ln \sigma_n + (1-y_n)\ln (1-\sigma_n)\} + \lambda^2\left(||\boldsymbol{w}||_p\right)^p$,

Donde $||\boldsymbol{w}||_p = \left(\sum_{j=1}^M |w_i|^p\right)^{1/p}$. Por ejemplo, para $p = 1$ : 

$E(\boldsymbol{w}) = -\sum_{n=1}^N \{y_n\ln \sigma_n + (1-y_n)\ln (1-\sigma_n)\} + \lambda^2\sum_{j=1}^M |w_j|$,

La cual es llamada regularización L1 para Regresión logística.

Para $p = 2$ : 

$E(\boldsymbol{w}) = -\sum_{n=1}^N \{y_n\ln \sigma_n + (1-y_n)\ln (1-\sigma_n)\} + \lambda^2\sum_{j=1}^M w_j^2$,

Llamada regularización L2 para regresión logística. 

En la práctica, el intercepto no es parte del factor de penalización, sino forzaríamos a que este fuese cero.

En scikit-learn el término regularizador corresponde a la constate $C$, equivalente a $1/\lambda^2$.

In [ ]:
logreg = LogisticRegression(C = 1e5)
logreg.fit(x2,y2)

y_pred = logreg.predict(np.c_[x1_v.ravel(), x2_v.ravel()])
y_pred = y_pred.reshape((bins, bins))

plt.clf()
plt.figure(figsize=(4,4))
plt.contourf(x1_v, x2_v, y_pred, cmap=plt.cm.Paired, alpha=0.8)
plt.scatter (x2[:, 0], x2[:,1], c = (1-y2), alpha = 0.5, cmap=plt.cm.jet)
plotMVN (mvn2)
plt.show()

## Regresión logística multiclase:

Ahora utilizaremos los datos provenientes de las 3 funciones normales multivariadas.

In [ ]:
x3 = np.concatenate ((x[0], x[1], x[2]))
y3 = np.zeros(3*N)
y3[N:2*N] = 1
y3[2*N:] = 2

plt.clf()
plt.figure(figsize =(4,4))
colors = ["blue", "green", "red"]
plotMVN (mvn)
plt.scatter (x3[:, 0], x3[:,1], c = (y3), alpha = 0.8, cmap=plt.cm.jet)
plotMVN (mvn)
plt.show()

La regresión logística multiclase es llamada por defecto "Una contra todos".
Si tenemos 3 clases, entonces ajustamos 3 regresiones logísticas, donde la probabilidad de cada categoría es predicha sobre el resto de las categorías combinadas. En nuestro caso, necesitamos entrenar 3 modelos:

1. $C_1$ contra $C_2$ y $C_3$ combinados
2. $C_2$ contra $C_1$ y $C_3$ combinados
3. $C_3$ contra $C_2$ y $C_1$ combinados

Scikit-learn tiene esto implementado

In [ ]:
logreg = LogisticRegression(C = 1)
logreg.fit(x3,y3)

y_pred = logreg.predict(np.c_[x1_v.ravel(), x2_v.ravel()])
y_pred = y_pred.reshape((bins, bins))

plt.clf()
plt.figure(figsize=(4,4))
plt.contourf(x1_v, x2_v, y_pred, cmap=plt.cm.Paired, alpha=0.8)
plt.scatter (x3[:, 0], x3[:,1], c = (y3), alpha = 0.5, cmap=plt.cm.jet)
plotMVN (mvn)
plt.show()

## Ahora nos vamos con un ejercicio

In [ ]:
df = pd.read_csv('https://stats.idre.ucla.edu/stat/data/binary.csv')
df.head()
# Base de datos de postulantes de postgrado a UCLA. La columna admit define si el estudiante es aceptado o no.
# 0: No es aceptad, 1: es aceptado

In [ ]:
# Debemos cambiar el nombre de la columna "rank" por "prestige", pues rank es un método de pandas.
df.columns = ["admit", "gre", "gpa", "prestige"]
df.head()

In [ ]:
df.describe()

In [ ]:
# Los histogramas son muchas veces una de las herramientas más importantes en un análisis exploratorio.
# Son capaces de darnos de una manera muy simple una interpretación de como están distribuidos nuestros datos.
df.hist()
plt.show()

In [ ]:
pd.crosstab(df['admit'], df['prestige'], rownames=['admit'])

In [ ]:
dummy_ranks = pd.get_dummies(df['prestige'], prefix='prestige', drop_first=True)
dummy_ranks.head()

In [ ]:
cols_to_keep = ['admit', 'gre', 'gpa']
data = df[cols_to_keep].join(dummy_ranks.loc[:, 'prestige_2':])
data['intercept'] = 1.0

data.head()

In [ ]:
X = data[data.columns[1:]]
y = data['admit']

X.head()

In [ ]:
y.head()

## Tarea
Utilizando el método `train_test_split` entregue el vector *y* y la matrix *X* con un tamaño del subset test en 30% (`test_size=0.3`) y elija una semilla de 12 para poder comparar los resultados con los demás (`random_state=12`). Recuerda que el único parámetro que hemos vistode regresión logística es el inverso de la regularización, pruebe con los siguientes valores para ver que tan importante es este parámetro `params = [1,10,50,100,500,1000,10000]`.

Para ver cual es el mejor utilice el método `logit.score`

Un método efectivo y visual para ver que tan bien nuestro modelo está efectuando la decisión es por medio de la matrix de confusión, aca tienes un código para crear una matrix de confunción

In [ ]:
import itertools
def plot_confusion_matrix(cm, classes,
                          title='Confusion matrix',
                          cmap=plt.cm.Blues, save_as='conf_mtrx_interp', 
                          use_sm = -1):
    
    """
    Este método plotea la matrix de confusión dado las siguientes features
    
    cm= metodo confusion matrix con los datos y los predichos confusion_matrix(y_test,y_pred), 
    classes=un vector que defina todas las clases,
    title= titulo de la matrix de confusión, por default 'Confusion matrix',
    cmap=paleta de colores, por default plt.cm.Blues, 
    save_as=si quieres guardalo, por default'conf_mtrx_interp', 
    use_sm = -1)
    """
    
    plt.clf()

    cm = cm.astype('float') / cm.sum(axis=1)[:, np.newaxis]
    plt.imshow(cm, interpolation='nearest', cmap=cmap)
    plt.title(title)
    plt.colorbar()
    tick_marks = np.arange(len(classes))
    plt.xticks(tick_marks, classes, rotation=45)
    plt.yticks(tick_marks, classes)
    fmt = '.2f'
    thresh = cm.max() / 2.
    for i, j in itertools.product(range(cm.shape[0]), range(cm.shape[1])):
        plt.text(j, i, format(cm[i, j], fmt),
                 horizontalalignment="center",
                 color="white" if cm[i, j] > thresh else "black")
    plt.tight_layout()
    plt.ylabel('True label')
    plt.xlabel('Predicted label')
    plt.show()

utilizando la predicción dada por el modelo plotea la matrix de confusión

### Un ejemplo de la matrix de confusión
Para que veas como usarlo

In [ ]:
from sklearn.datasets import load_iris
from sklearn.model_selection import KFold, cross_val_score

iris = load_iris()
x = iris.data
y = iris.target
c=10e3
lr = LogisticRegression(C = c)
sc = cross_val_score(lr, x, y, cv=10)*100
print("Regresión logística = ", np.mean(sc), " +- ", np.std(sc))
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=77)
logit = LogisticRegression(C=c)
logit.fit(X_train, y_train)
y_pred = logit.predict(X_test)
confu = confusion_matrix(y_test, y_pred)

class_names=['Iris-Setosa','Iris-Versicolour','Iris-Virginica']
plt.figure()
plot_confusion_matrix(confu, classes=class_names,
                      title='Normalized confusion matrix')

Además, puedes utilizar otros métodos de prueba de predicción como `f1 score`

In [ ]:
from sklearn.metrics import fl_score
print(fl_score(y_test, y_pred, average = 'macro'))

# Más revisión de Pandas

## Handling Missing Data
The difference between data found in many tutorials and data in the real world is that real-world data is rarely clean and homogeneous.
In particular, many interesting datasets will have some amount of data missing.
To make matters even more complicated, different data sources may indicate missing data in different ways.

In this section, we will discuss some general considerations for missing data, discuss how Pandas chooses to represent it, and demonstrate some built-in Pandas tools for handling missing data in Python.
Here and throughout the book, we'll refer to missing data in general as *null*, *NaN*, or *NA* values.

### Trade-Offs in Missing Data Conventions

There are a number of schemes that have been developed to indicate the presence of missing data in a table or DataFrame.
Generally, they revolve around one of two strategies: using a *mask* that globally indicates missing values, or choosing a *sentinel value* that indicates a missing entry.

In the masking approach, the mask might be an entirely separate Boolean array, or it may involve appropriation of one bit in the data representation to locally indicate the null status of a value.

In the sentinel approach, the sentinel value could be some data-specific convention, such as indicating a missing integer value with -9999 or some rare bit pattern, or it could be a more global convention, such as indicating a missing floating-point value with NaN (Not a Number), a special value which is part of the IEEE floating-point specification.

None of these approaches is without trade-offs: use of a separate mask array requires allocation of an additional Boolean array, which adds overhead in both storage and computation. A sentinel value reduces the range of valid values that can be represented, and may require extra (often non-optimized) logic in CPU and GPU arithmetic. Common special values like NaN are not available for all data types.

As in most cases where no universally optimal choice exists, different languages and systems use different conventions.
For example, the R language uses reserved bit patterns within each data type as sentinel values indicating missing data, while the SciDB system uses an extra byte attached to every cell which indicates a NA state.

### Missing Data in Pandas

The way in which Pandas handles missing values is constrained by its reliance on the NumPy package, which does not have a built-in notion of NA values for non-floating-point data types.

Pandas could have followed R's lead in specifying bit patterns for each individual data type to indicate nullness, but this approach turns out to be rather unwieldy.
While R contains four basic data types, NumPy supports *far* more than this: for example, while R has a single integer type, NumPy supports *fourteen* basic integer types once you account for available precisions, signedness, and endianness of the encoding.
Reserving a specific bit pattern in all available NumPy types would lead to an unwieldy amount of overhead in special-casing various operations for various types, likely even requiring a new fork of the NumPy package. Further, for the smaller data types (such as 8-bit integers), sacrificing a bit to use as a mask will significantly reduce the range of values it can represent.

NumPy does have support for masked arrays – that is, arrays that have a separate Boolean mask array attached for marking data as "good" or "bad."
Pandas could have derived from this, but the overhead in both storage, computation, and code maintenance makes that an unattractive choice.

With these constraints in mind, Pandas chose to use sentinels for missing data, and further chose to use two already-existing Python null values: the special floating-point ``NaN`` value, and the Python ``None`` object.
This choice has some side effects, as we will see, but in practice ends up being a good compromise in most cases of interest.

#### ``None``: Pythonic missing data

The first sentinel value used by Pandas is ``None``, a Python singleton object that is often used for missing data in Python code.
Because it is a Python object, ``None`` cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type ``'object'`` (i.e., arrays of Python objects):

In [58]:
import numpy as np
import pandas as pd

In [59]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

This ``dtype=object`` means that the best common type representation NumPy could infer for the contents of the array is that they are Python objects.
While this kind of object array is useful for some purposes, any operations on the data will be done at the Python level, with much more overhead than the typically fast operations seen for arrays with native types:

In [60]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
99.6 ms ± 3.93 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
4.18 ms ± 225 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

The use of Python objects in an array also means that if you perform aggregations like ``sum()`` or ``min()`` across an array with a ``None`` value, you will generally get an error:

In [61]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

This reflects the fact that addition between an integer and ``None`` is undefined.

### ``NaN``: Missing numerical data

The other missing data representation, ``NaN`` (acronym for *Not a Number*), is different; it is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation:

In [62]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

Notice that NumPy chose a native floating-point type for this array: this means that unlike the object array from before, this array supports fast operations pushed into compiled code.
You should be aware that ``NaN`` is a bit like a data virus–it infects any other object it touches.
Regardless of the operation, the result of arithmetic with ``NaN`` will be another ``NaN``:

In [63]:
1 + np.nan

nan

In [64]:
0 *  np.nan

nan

Note that this means that aggregates over the values are well defined (i.e., they don't result in an error) but not always useful:

In [65]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

NumPy does provide some special aggregations that will ignore these missing values:

In [66]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

Keep in mind that ``NaN`` is specifically a floating-point value; there is no equivalent NaN value for integers, strings, or other types.

### NaN and None in Pandas

``NaN`` and ``None`` both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate:

In [67]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

For types that don't have an available sentinel value, Pandas automatically type-casts when NA values are present.
For example, if we set a value in an integer array to ``np.nan``, it will automatically be upcast to a floating-point type to accommodate the NA:

In [68]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [69]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

Notice that in addition to casting the integer array to floating point, Pandas automatically converts the ``None`` to a ``NaN`` value.
(Be aware that there is a proposal to add a native integer NA to Pandas in the future; as of this writing, it has not been included).

While this type of magic may feel a bit hackish compared to the more unified approach to NA values in domain-specific languages like R, the Pandas sentinel/casting approach works quite well in practice and in my experience only rarely causes issues.

The following table lists the upcasting conventions in Pandas when NA values are introduced:

|Typeclass     | Conversion When Storing NAs | NA Sentinel Value      |
|--------------|-----------------------------|------------------------|
| ``floating`` | No change                   | ``np.nan``             |
| ``object``   | No change                   | ``None`` or ``np.nan`` |
| ``integer``  | Cast to ``float64``         | ``np.nan``             |
| ``boolean``  | Cast to ``object``          | ``None`` or ``np.nan`` |

Keep in mind that in Pandas, string data is always stored with an ``object`` dtype.

## Operating on Null Values

As we have seen, Pandas treats ``None`` and ``NaN`` as essentially interchangeable for indicating missing or null values.
To facilitate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas data structures.
They are:

- ``isnull()``: Generate a boolean mask indicating missing values
- ``notnull()``: Opposite of ``isnull()``
- ``dropna()``: Return a filtered version of the data
- ``fillna()``: Return a copy of the data with missing values filled or imputed

We will conclude this section with a brief exploration and demonstration of these routines.

### Detecting null values
Pandas data structures have two useful methods for detecting null data: ``isnull()`` and ``notnull()``.
Either one will return a Boolean mask over the data. For example:

In [70]:
data = pd.Series([1, np.nan, 'hello', None])

In [71]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

As mentioned in Data Indexing and Selection, Boolean masks can be used directly as a ``Series`` or ``DataFrame`` index:

In [72]:
data[data.notnull()]

0        1
2    hello
dtype: object

The ``isnull()`` and ``notnull()`` methods produce similar Boolean results for ``DataFrame``s.

### Dropping null values

In addition to the masking used before, there are the convenience methods, ``dropna()``
(which removes NA values) and ``fillna()`` (which fills in NA values). For a ``Series``,
the result is straightforward:

In [73]:
data.dropna()

0        1
2    hello
dtype: object

For a ``DataFrame``, there are more options.
Consider the following ``DataFrame``:

In [74]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

We cannot drop single values from a ``DataFrame``; we can only drop full rows or full columns.
Depending on the application, you might want one or the other, so ``dropna()`` gives a number of options for a ``DataFrame``.

By default, ``dropna()`` will drop all rows in which *any* null value is present:

In [75]:
df.dropna()

     0    1  2
1  2.0  3.0  5

Alternatively, you can drop NA values along a different axis; ``axis=1`` drops all columns containing a null value:

In [76]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

But this drops some good data as well; you might rather be interested in dropping rows or columns with *all* NA values, or a majority of NA values.
This can be specified through the ``how`` or ``thresh`` parameters, which allow fine control of the number of nulls to allow through.

The default is ``how='any'``, such that any row or column (depending on the ``axis`` keyword) containing a null value will be dropped.
You can also specify ``how='all'``, which will only drop rows/columns that are *all* null values:

In [77]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [78]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

For finer-grained control, the ``thresh`` parameter lets you specify a minimum number of non-null values for the row/column to be kept:

In [79]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

Here the first and last row have been dropped, because they contain only two non-null values.

### Filling null values

Sometimes rather than dropping NA values, you'd rather replace them with a valid value.
This value might be a single number like zero, or it might be some sort of imputation or interpolation from the good values.
You could do this in-place using the ``isnull()`` method as a mask, but because it is such a common operation Pandas provides the ``fillna()`` method, which returns a copy of the array with the null values replaced.

Consider the following ``Series``:

In [80]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

We can fill NA entries with a single value, such as zero:

In [81]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

We can specify a forward-fill to propagate the previous value forward:

In [82]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [83]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

For ``DataFrame``s, the options are similar, but we can also specify an ``axis`` along which the fills take place:

In [84]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [85]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [86]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [87]:
df.fillna(method='bfill', axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [ ]:
#### Respuesta Tarea
for c in params:
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=77)
    logit = LogisticRegression(C=c)
    logit.fit(X_train, y_train)
    print('Accuracy: {:.2f}'.format(logit.score(X_test, y_test)))

In [ ]:
y_pred = logit.predict(X_test)
confu = confusion_matrix(y_test, y_pred)

class_names=['Admitted','Non Admitted']
plt.figure()
plot_confusion_matrix(confu, classes=class_names,
                      title='Normalized confusion matrix')